% 设机器人标准动力学方程为：tau = M*ddq+C*dq+G
% 定义关节数量
N = 2;

% 关节旋转角矩阵，使用sym函数，根据关节数量N自动生成符号变量列向量
% 以二关节为例，mat_q=[q_1;q_2],下面定义关节位置、关节速度、关节加速度
mat_q = sym('q_',[N,1]);
mat_dq = sym('dq_', [N, 1]);
mat_ddq = sym('ddq_', [N, 1]);

% 连杆长度矩阵
mat_L = sym('L_',[N,1]);

% 输入：MDH表
Mat_MDH = [
    0 0         0   mat_q(1);
    0 mat_L(1)  0   mat_q(2)];

% 空间变换
% 齐次变换矩阵函数，根据MDH得到齐次变换矩阵T，T^1代表 ^1T_2 这个齐次变换矩阵
T = make_T(Mat_MDH);
T_1 = T(:,:,1);  % ^1T_2
T_2 = T(:,:,2);  % ^2T_3

% 生成6*6空间变换矩阵（参考书本：刚体动力学）
X = make_X(T);
X_1 = X(:,:,1);
X_2 = X(:,:,2);


% 连杆质量矩阵
mat_m = sym('m_',[N,1]);


% 前向递推：从基座到末端


% 反向递推：从末端到基座
